#Знакомство с языком Python (семинары). Урок 4. Данные, функции и модули в Python. Продолжение

# 5. Даны два файла, в каждом из которых находится запись многочлена.
# Задача - сформировать файл, содержащий сумму многочленов. 
# (нужно два полинома сложить. Файлы взять благодаря предыдущему заданию)


def polynom():
    import random
    k = [random.randint(1, 100) for i in range(random.randint(2, 10))]
    print('Натуральная степень: n =', len(k)-1) 
    m = ''
    for i in range(0, len(k)):
        m = m + str(k[i]) 
        if i < len(k) - 1:
            m += 'х'
        if i < len(k)- 2:
            m += '^'+ str(len(k) - i - 1)
        if i < len(k) - 1:
            m += ' + '
    m += ' = 0'
    return (m)
    
p1 = polynom()
p2 = polynom()
print(p1)
print(p2)

def koeff(str):
    